{
  "headline": "Teenager who stabbed woman nine times jailed",
  "date": "1 hour ago",
  "content": [
    "Dylan Minton has been jailed for six years and one month",
    "A teenager who stabbed a woman nine times in a woodland near a secondary school on the Isle of Man has been jailed.",
    "Dylan Minton, 18, lured the victim to meet him behind Queen Elizabeth II (QEII) High School in Peel on 4 September 2024, on the pretence that he would collect drugs from her - but instead stabbed her in the abdomen, arm and back. ",
    "He pleaded guilty at Douglas Courthouse to charges including wounding with intent and being concerned in the supply of cocaine, and was sentenced to six years and one month in jail.",
    "Jailing him for six years and one month, Deemster Graeme Cook said it was a \"sustained and frenzied attack\" which had a \"potentially horrific outcome.\"",
    "The court heard Minton had cut his thumb and index finger, which the prosecution argued would probably have happened as he stabbed the victim just after 21:20 BST. ",
    "Minton, who was 17 at the time, was called by his father just after the attack to ask where he was. ",
    "He was hiding in a bush outside QEII with a bloody right hand when his dad picked him up, the court heard.",
    "Minton was arrested later that night, initially claiming someone made him do it, but later telling police that he himself was stabbed. ",
    "The court heard he said he was under the influence of another individual who he owed a significant drug debt to.",
    "In a victim impact statement read to the court, the woman said: \"The night I was stabbed nine times my life changed forever. ",
    "\"The harm done to me cannot be undone. I live with the consequences of that night every day.\"",
    "A subsequent investigation into Minton's phone, found messages which showed that Minton was concerned in the supply of up to 25g of cocaine, and up to 1,500g of cannabis between 22 June and 1 September that year. ",
    "The prosecutor told the court that Minton was \"involved in regular and consistent street dealing\" during that period.",
    "He had also been arrested in the early hours of 31 May after smelling like cannabis, and a search of him found £3,912 of cannabis, and £1,035 of cash. ",
    "Minton pleaded guilty to wounding with intent, being concerned in the supply of cocaine, being concerned in the supply of cannabis, possession with intent to supply of cannabis, possession of cannabis and possession of criminal property.",
    "Deemster Graeme Cook said while under current laws Minton, who was 17 at the time, would be considered an adult on the island, but under new laws set to come into effect early next year he would be considered a juvenile. ",
    "Therefore, he gave him a significantly shorter sentence due to his age and said: \"I think for somebody so young, an extended sentence would not be right.\"",
    "\"This case shows to the Isle of Man public what can happen when young boys get involved in drugs taking and drugs supplying.\"",
    "Read more stories from the Isle of Man on the BBC, watch BBC North West Tonight on BBC iPlayer and follow BBC Isle of Man on Facebook, external and X, external."
  ],
  "predictedGuesses": 60
}