{
  "headline": "Hospital staff to strike over 'appalling' workload",
  "date": "16 December 2025",
  "content": [
    "Pathology staff at Airedale are due to strike from 18 December",
    "Medical laboratory scientists who say they are \"underpaid and overworked\" are to strike in the run up to Christmas.",
    "Staff at Airedale NHS Foundation Trust in Bradford are set to walk out from 18 to 25 December, union Unite said.",
    "The union said the trust had failed to address the fact that its microbiology workers were \"on the pay band below what they should be for the work they carry out\".",
    "Afruj Ruf, managing director of Integrated Pathology Solutions, a joint venture between a number of hospitals, said they had \"contingency plans in place and will work hard to minimise disruption\".",
    "Unite said: \"The trust has also agreed to undertake extra work for another trust that the microbiology workers will have to carry out, increasing the number of call outs during nights and weekends. ",
    "\"As a result, out of hours rotas have been changed without consultation or regard to current workloads.\"",
    "Unite general secretary Sharon Graham, said: \"Airedale trust's leadership are treating these workers appallingly.",
    "\"Not only are they being underpaid, but now the trust expects them to take on out of hours work on top of their already considerable workloads. ",
    "Mr Ruf said: \"Our committed staff provide critical, scientific analysis that supports our clinical colleagues and helps patients to get the diagnoses that they need.",
    "\"Every member of staff is appointed to a job description which aligns to national role profiles and salary bands.  ",
    "\"We would never change rotas without consultation or without regard to workloads and, whilst we have explored a number of solutions to provide cover for this work, we are not asking our microbiology biomedical scientists to undertake out of hours work for another trust.\"",
    "He added: \"We regret that we were not able to reach a mutually acceptable agreement with Unite.  However, we have contingency plans in place and will work hard to minimise disruption.",
    "\"We remain committed to working in partnership with Unite and I hope that we are able to resolve this dispute swiftly.\""
  ],
  "predictedGuesses": 53
}