{
  "headline": "Urgent treatment centre shut over staff illness",
  "date": "17 December 2025",
  "content": [
    "Keswick UTC has closed for six days because of staff sickness (file photo)",
    "A town's urgent treatment centre has temporarily closed because some of its staff are ill.",
    "North Cumbria Integrated Care NHS Foundation Trust (NCIC) said the medical facility in Keswick, Cumbria, was closing for six days due to \"temporary staffing pressures\" and was expected to reopen on Monday.",
    "The trust said the closure was due to \"staff sickness\" and unrelated to the resident doctor strike, which is set to run until Monday.",
    "Chief operating officer Imran Devji said closing the Keswick site would allow it to have enough staff to \"provide safe and high quality care\" at Penrith's urgent treatment centre.",
    "He said the trust's priority was \"always\" safety and the lack of safe staffing levels meant it had to make \"some difficult decisions\".",
    "\"We apologise for any inconvenience this may cause and we are grateful for everyone's patience and understanding while we work hard to reopen the centre as soon as possible,\" he said.",
    "During the Keswick closure, the Penrith centre will open from 08:00 until 22:00 GMT, seven days a week.",
    "The closure of the Keswick facility takes place at the same time as a five-day doctor strike across England.",
    "NCIC said it would work to minimise the impact of the strikes on services and the majority of planned operations and outpatient services would be maintained.",
    "However, it warned that patients with non-urgent needs might experience long waits.",
    "NCIC's executive medical director Dr Adrian Clements said the industrial action was taking place at a time when flu was circulating widely and services were under \"significant pressure\".",
    "\"Please only attend urgent and emergency care if it is truly an emergency,\" he said.",
    "\"Unfortunately those who do need to come may face longer waits to be seen and treated, as fewer medical staff will be available, and we apologise in advance.\"",
    "The trust has also asked people not to visit loved ones in hospital if they have felt unwell in the past 48 hours.",
    "Do you have a story suggestion for BBC Cumbria?"
  ],
  "predictedGuesses": 56
}