{
  "headline": "Driver who killed teens given longer jail term",
  "date": "17 December 2025",
  "content": [
    "Natasha Allarakhia, 36, was speeding at 96mph just before the crash",
    "A speeding driver who killed two teenagers after drinking at the wheel has had her prison sentence increased.",
    "Natasha Allarakhia, 36, smashed into the back of a stationary Ford Fiesta on the A17 at North Rauceby, Lincolnshire, in June 2024.",
    "In August, she was jailed for 10 years at Lincoln Crown Court after pleading guilty to causing death by dangerous driving and causing serious injury.",
    "Allarakhia, of Turner Crescent, Norwich, has now had her sentence increased to 12 years and eight months after the Attorney General's Office (AGO) referred the case to the Court of Appeal.",
    "William Ray, 17, who was driving the Fiesta, and his passenger Eddie Shore,18, died in the crash. A second passenger, Jack Prince, 18, suffered life-changing injuries.",
    "Allarakhia was sipping alcohol at the wheel and speeding at 96mph (154km/h) before hitting the car.",
    "At the sentencing hearing in August, Lincoln Crown Court heard she laughed when she passed a roadside breath test.",
    "She had five previous convictions for 12 offences, including a bad driving record.",
    "MP Caroline Johnson says the sentence \"can almost never be enough\"",
    "The case was referred to the AGO by Dr Caroline Johnson, the MP for Sleaford and North Hykeham, who described the sentence as \"unduly lenient\".",
    "In a letter to Dr Johnson dated 11 September, the AGO said it had received \"numerous requests\" to review the sentence.",
    "The AGO said the matter was considered under the Unduly Lenient Sentence scheme, which allows anyone to ask for certain sentences handed down in a crown court to be reviewed.",
    "Dr Johnson said: \"I'm pleased that the sentence has been extended and that the court recognised that the sentence was unduly lenient. ",
    "\"No sentence, however long, can bring back Will Ray and Eddie Shore. No sentence can remove the injuries that the young man Jack Prince experiences as well.",
    "\"On one hand I'm pleased the sentence has gone up, but on the other hand it can almost never be enough.\"",
    "Solicitor General Ellie Reeves said: \"Natasha Allarakhia's extended sentence reflects not only her dangerous driving but also her lying to the police, external at the scene pinning the blame on someone else.\"",
    "Download the BBC News app from the App Store, external for iPhone and iPad or Google Play, external for Android devices"
  ],
  "predictedGuesses": 59
}