{
  "headline": "Scotland records sunniest year since 1955",
  "date": "17 December 2025",
  "content": [
    "The north east of Scotland saw a great deal of sunshine, including at this park in Aberdeen",
    "Scotland experienced its sunniest year since the 1950s over the last 12 months, according to new figures.",
    "The country bathed in sunshine for 1,381.3 hours - equivalent to about 57 days – during 2025.",
    "The Met Office said those figures put the year second, behind 1955, on the list since records began.",
    "Provisional data from the national weather service shows this year is the sunniest on record for the UK as a whole.",
    "Forecasters said Scotland saw 15% more sunshine than average for the whole year up to 15 December.",
    "The current record was set 70 years ago, when 1,444.5 hours - about 60 days - were recorded across the year.",
    "Met Office spokesman Stephen Dixon said those in the north of the country experienced the best of the sunshine, while the east also had more bright days than the west.",
    "He added: \"While the UK has already broken its annual sunshine record, Scotland has also had a very sunny year with it currently sitting second with a couple of weeks to go.",
    "\"All regions of Scotland are showing a year of above average sunshine already, though the west is slightly behind the north and east in terms of comparisons to their respective averages.\"",
    "Scotland experienced its second-sunniest year on record in 2025",
    "The top temperature was set at 32.2C (90F) in Aviemore in the Highlands on 12 July, while the lowest for the year saw the mercury plummet to -18.9C (66F) on 11 January at Altnaharra in the Highlands.",
    "However, a higher temperature does not necessarily guarantee more sunny days, the Met Office said.",
    "The UK recorded a total of 1,622 hours of sunshine in 2025, including the sunniest spring on record.",
    "That beats the previous figure set in 2003.",
    "It is a sharp contrast to 2024, which was the UK's dullest year since 1998.",
    "England had its sunniest year on record this year, while Wales had its sixth.",
    "The Met Office said Northern Ireland had experienced \"above average\" levels of sunshine this year, but not enough to crack its 10 sunniest years on record.",
    "Met Office senior scientist Mike Kendon said: \"The record-breaking sunshine across the UK this year was driven by the frequent influence of high pressure that reduced cloud cover and brought sunny skies for many.",
    "\"While sunny periods are not unusual at this time of year, the duration and consistency of high-pressure systems made 2025 notably sunnier than average.",
    "\"So far this year, only the months of February and October have recorded below-average sunshine hours.\""
  ],
  "predictedGuesses": 55
}