{
  "headline": "I'd rather stay in Newport than New York, says travel writer ",
  "date": "17 December 2025",
  "content": [
    "The writer said he went to Newport with an open heart and mind",
    "An award-winning travel writer has declared Newport to be the best city in Wales, saying he would rather have a weekend there than in New York.",
    "Ben Aitken's latest book is a love letter to some of the most underappreciated cities in the UK, in which he describes his unlikely south Wales staycation favourite as \"lush\" and \"well worth visiting\".",
    "The Portsmouth-born author said he wanted to \"spread the love beyond the usual sightseeing suspects\", destinations which he called \"often overdone and over priced\".",
    "Describing Newport as \"imperfectly perfect\", he said people needed to start believing in the city and challenging existing preconceptions about it.",
    "Earlier this year, research by Go.Compare named Newport as the \"worst\" place to stay in the country, ranking it lowest out of 55 destinations across the UK in terms of family-friendly accommodation and visitor attractions.",
    "But Mr Aitken insisted his book was not about him \"taking the mickey or firing cheap shots\".",
    "\"A lot of cities these days are oversubscribed, with some like Manchester even charging tourist tax,\" he said.",
    "\"So, as part of my research for the book, I contacted a load of tourism boards to find out which places people just weren't going to.",
    "\"As a result I went to Newport with an open heart and was taken pleasantly by surprise.\"",
    "Ben Aitken highlighted local attractions such as Newport's velodrome",
    "A once booming docks town - which officially became a city in 2002 - Mr Aitken added that \"a lot of that majesty still existed in the architecture of the buildings there\", while all around was \"steeped in history\", such as the 1839 Chartist Uprising.    ",
    "He namechecked a number of \"great local indie businesses, from bars and restaurants to coffee houses,\" attractions like the city's velodrome, nearby 17th Century Tredegar House, the Transporter Bridge and sprawling Sites of Special Scientific Interest such as the Gwent Levels.        ",
    "Also important, Mr Aitken said, was Newport's musical heritage - it having once been dubbed \"the New Seattle\" for its burgeoning live scene, not to mention being where The Clash's Joe Strummer started out and where Nirvana's Kurt Cobain proposed to Courtney Love.",
    "The architecture of Newport's buildings still displayed some its previous majesty, said Mr Aitken",
    "\"However, when I mentioned my love for the place during a recent radio interview, I got the feeling the presenter wanted to stop the broadcast to check I was okay - and that's the problem,\" he told Radio Wales Breakfast.",
    "\"The only way Newport will get the love and affection it deserves is if people start thinking about it differently.  ",
    "\"Because, when places get a reputation and nobody bothers to challenge it, it's hard for them to start prospering again.\"",
    "Other places visited for his research included Sunderland, Bradford and Chelmsford.",
    "Mr Aitken said that perhaps Newport could follow in Wrexham's footsteps, the north Wales city having seen a change in fortunes since its football club was taken over by Hollywood stars Ryan Reynolds and Rob Mac - formerly McElhenney.",
    "\"Okay, so maybe Beyonce isn't about to buy the Gwent Dragons rugby team, but that outlook still needs to change.",
    "\"Otherwise, rather than a destination, Newport will forever remain a place you simply pass through to get somewhere else.\" "
  ],
  "predictedGuesses": 65
}