{
  "headline": "Trading not viable after sinkhole, businesses say",
  "date": "16 December 2025",
  "content": [
    "There were hopes that the street could reopen in December, but work will now continue until March",
    "The owner of a business which shut after losing 90% of its income following the closure of Godstone High Street says it was not \"financially viable\" to continue trading.",
    "This street has been closed since February due to the presence of a giant sinkhole, with engineers since discovering a network of Victorian sand mining tunnels around the site.",
    "There were hopes that the street could reopen in December, but SES Water confirmed last month that work would continue until at least March.",
    "Surrey County Council says it is \"hugely sympathetic to the disruption caused to the residents and businesses of Godstone\".",
    "Work to repair Godstone High Street, which collapsed nine months ago, will not be completed until March at the earliest",
    "One such business is Dorwyn Windows, whose owner Will McLean made the \"upsetting\" decision to shut the Godstone branch around a month ago.",
    "Mr McLean says the sinkhole \"literally turned the tap off in terms of footfall and retail people coming through the door\".",
    "The business, which had been trading for about five years, went from having about ten through-the-door inquiries a week to being \"lucky if we had one\".",
    "This video can not be played",
    "Huge sinkhole appears in high street",
    "As time went on the branch became increasingly reliant on its Reigate counterpart.",
    "This, Mr McLean says, was unsustainable.",
    "He said: \"It got to the point where it constantly subsidised Godstone. I had a member of staff in here. We had rent to pay as well. Realistically it was costing £5,000 a month to keep Godstone going.\"",
    "After much soul searching the owner, who also lives in the village, concluded that it was \"not financially viable to keep throwing money at something when it's just not producing any income\".",
    "Mr McLean said he was \"constantly living in hope\" for a resolution, but the situation became too acute.",
    "Pub landlord Mark Cullinan says the impact of the closure on residents and businesses has been \"ridiculous\"",
    "Mark Cullinan, who has been the landlord of the Hare and Hound Pub for 21 years, says his longevity in the village has saved the business.",
    "He said: \"If I hadn't been here as long as I have, [or] if I'd have just got here, we wouldn't have survived it. No two ways about it.\"",
    "Mr Cullinan says takings were down 40 percent, and that the pub has lost \"upwards of £65,000\".",
    "He urged people to see the scale of the issue. ",
    "\"They haven't closed a side road,\" he said.",
    "\"It's not just a road about five people use a day, this is a road that 10,000 people use a week.\"",
    "A spokesperson for SCC said: \"Having now concluded our in-depth investigations of the mine network, we have uncovered a much larger tunnel network than expected. ",
    "\"In addition, the sand we have uncovered is very unstable and we are having to take a lot more time filling the mines to ensure the area is safe.",
    "\"We are hugely sympathetic to the disruption caused to the residents and businesses of Godstone and are working hard to get the road safely open as soon as possible.\""
  ],
  "predictedGuesses": 61
}