{
  "headline": "Fewer Christmas hospital admissions expected as flu rate slows",
  "date": "17 December 2025",
  "content": [
    "Flu cases are continuing to rise in Wales, but the rate of increase is starting to slow down.",
    "The latest figures, from Public Health Wales (PHW), show flu was circulating at \"medium intensity\" in Wales during the second week of December.",
    "The report states that during the next two weeks - which covers Christmas - hospital admissions with flu \"are forecasted to be lower compared to the same period last year\".",
    "It comes as Wales' top doctor says it is impossible to say whether this flu season is worse than usual.",
    "In the community, consultations to GPs for flu are continuing to rise and are highest at this point of the winter cycle - at medium intensity level - but it still isn't possible to predict when the peak will be.",
    "Hundreds of patients in hospital are also tested each week for a range of respiratory conditions - and the proportion positive for flu rose to 18.7% from 17.7% the week before, which is the highest level so far this winter.",
    "The numbers of patients in hospital with confirmed flu also rose to 278 from 258 the previous week. More than half are aged over 80.",
    "Of these, these there were five patients in intensive care with flu, although this is a drop compared to 12 the previous week.",
    "But the numbers of patients admitted to hospital with flu decreased, with 152 admitted during the second week of December compared to 163 the week before.",
    "Earlier the Welsh government's chief medical officer suggested flu was currently circulating in Wales at levels that were in line with what would be expected in a normal winter.",
    "But Prof Isabel Oliver warned that it was not possible tell how much further rates will climb or whether a different strain of flu will emerge and cause more problems later in the season.",
    "Public health officials say although we've had a bit of a pause, flu cases could still rise in future weeks and more transmission is possible over Christmas as people get together.",
    "She is urging people who are eligible for a free NHS vaccine to take up the offer, saying she is worried that only about a third of people aged 16-64 with medical conditions that make them especially vulnerable have been vaccinated so far.",
    "\"We are very close to Christmas and I'm sure nobody wants to end up in hospital with flu over Christmas... so it's really important that those are eligible for the vaccine take up that offer,\" she said.",
    "The flu typically lasts about a week, with peak symptoms (fever, aches, tiredness) improving in two to three days, according to the NHS.",
    "But you can feel very tired and have a lingering cough for up to two weeks or longer, especially in vulnerable groups, so seek GP advice if symptoms worsen or don't improve after seven days.",
    "Prof Oliver said about 860,000 people in Wales have taken up the offer of a vaccine, which is better then last year \"but there is significant room for improvement\".",
    "Just over a third of adults in at-risk groups with health conditions have taken up an offer of a vaccine and 38% of frontline NHS staff.",
    "However Prof Oliver says she's encouraged that vaccination rates are much higher in other eligible groups.",
    "She says about two thirds of those aged 65 or over have received jabs and more than half of primary school children.",
    "But there have been reports of shortages in some pharmacies.",
    "Although the Welsh government is not responsible for that supply Prof Oliver says she \"is not aware of any issues on the private front\" and insisted there was \"no shortage\" at all in terms of NHS stock.",
    "However she conceded that this flu season had resulted in extra pressure on hospitals due to the rise in the number of patients with flu being admitted.",
    "But despite this extra strain Prof Oliver says she expects the NHS will be able to cope.",
    "\"There's inevitably pressure on the system.... but [we have] a range of plans in place to make sure we need to make sure we have the capacity we ned to be able to treat all the people who need treatment in hospital.\"",
    "Prof Oliver also says she's encouraged that early evidence did not suggest the type of flu circulating this year was significantly more dangerous than in previous years - despite it being described by some as \"super flu\"."
  ],
  "predictedGuesses": 65
}