{
  "headline": "Freemasons to sue Met over membership declaration",
  "date": "17 December 2025",
  "content": [
    "Freemasons originated with the stonemasons when cathedrals were being built",
    "The Metropolitan Police faces legal action over its plans to force officers to declare Freemason membership.",
    "Earlier this month, the Met said Freemasonry membership would be added to its declarable associations policy, following a review into the 1987 unsolved murder of a private detective Daniel Morgan that cited Freemasonry as a source of \"mistrust\" in investigations.",
    "Freemason organisations have warned the Met they will seek a judicial review if it proceeds with the move, which they say is discriminatory.",
    "The Met confirmed it had received a letter before claim from the United Grand Lodge of England (UGLE), the government body of Freemasonry in England.",
    "The force said it would not be appropriate to comment further.",
    "UGLE, which dates back to 1717, describes Freemason societies as being among the \"oldest social and charitable organisations in the world\", with its principles being \"integrity, friendship, respect and service\".",
    "However, they are widely believed to be secretive societies and have previously been linked to allegations of corruption within the Met.",
    "The Met's decision means officers and staff are now required to declare membership \"past or present\" of any organisation that is \"hierarchical, has confidential membership and requires members to support and protect each other\".",
    "The UGLE said that this requirement could undermine the public credibility of Freemasons, and could breach their human rights, as well data protection rules. ",
    "Adrian Marsh, grand secretary of UGLE, said: \"Freemasonry has the highest moral and ethical standards.",
    "\"The decision by the Metropolitan Police casts an aura of mistrust over the entire Freemason community... We now have no choice but to take legal action to challenge this unlawful decision.\"",
    "Mr Marsh called on force bosses to withdraw the move and \"work it through sensibly\" with the Freemasons to avoid expensive legal action.",
    "UGLE added that the requirement of Freemasons to support and protect each other comes with the caveat that this must not be to the detriment to their family or the law.",
    "The body also claims it was not properly included in the consultation process and that fewer than 5% of officers and staff completed a survey on the issue.",
    "A report into the unsolved murder of Daniel Morgan said Freemasonry membership among police had been a \"source of suspicion\" in the investigations",
    "The Met's decision followed a review into the force's handling of the unsolved murder case of Mr Morgan, external. ",
    "The 37-year-old father of two was killed with an axe in the car park of the Golden Lion pub in Sydenham, south-east London, on 10 March 1987.",
    "A string of inquiries since have unearthed allegations of corruption.",
    "The 2021 report said police officers' membership of the Freemasons had been \"a source of recurring suspicion and mistrust in the investigations\".",
    "The Met's decision follows a survey of officers and staff which showed two-thirds of respondents felt membership of such organisations affects perception of police impartiality and public trust, the force said.",
    "More recently, Met Police Commissioner Sir Mark Rowley has pushed the plan to declare membership as part of wider moves to improve transparency in the Met.",
    "Cdr Simon Messinger previously said it was the \"right time\" to address long-standing concerns and that public and staff confidence \"must take precedence over the secrecy of any membership organisation\".",
    "He added that the decision did not mean staff could not join the Freemasons or another similar organisation."
  ],
  "predictedGuesses": 59
}