{
  "headline": "Single-punch street attacker jailed for three years",
  "date": "3 hours ago",
  "content": [
    "Jackson Bennett was jailed at the High Court in Edinburgh",
    "A street attacker who punched a man and left him with life-changing injuries has been jailed for three and a half years.",
    "Jackson Bennett, 20, attacked 32-year-old Shaun Taylor during a night out on Aberdeen's Union Street on 11 August 2024.",
    "The court heard that after Bennett landed a single blow, Mr Taylor had to be placed into a medically induced coma and spent three months in hospital.",
    "Judge Lord Arthurson said the impact of the crime was \"life-changing\".",
    "The judge said Bennett walked away from the victim rather than calling for help after the assault.",
    "Shaun Taylor was left with facial fractures, a fractured skull and a bleed on the brain.",
    "The High Court in Edinburgh heard that the force of the punch left Mr Taylor unconscious and he fell backwards and hit the back of his head on the pavement.",
    "The attack was captured on CCTV and footage of the victim collapsing to the ground was previously shown to the court.",
    "Bennett earlier admitted assaulting Mr Taylor to his severe injury, permanent impairment and disfigurement and to the danger of his life.",
    "Mr Taylor underwent a tracheotomy and was at first unable to talk or walk because of his injuries. ",
    "He suffered hearing loss and still takes medication for seizures. He is currently unable to drive.",
    "The victim was out socialising with his partner Melissa Masson and friends in Aberdeen city centre when the attack happened.",
    "Bennett was also out with his friends. The men did not know one another.",
    "Just after midnight, Mr Taylor and his party were walking on Union Street when they passed Bennett and his group and words were exchanged between Bennett and Mr Taylor.",
    "They came face to face and Ms Masson told Mr Taylor to walk away, which he did.",
    "Bennett followed him for a short distance and Mr Taylor turned to speak to him when the attacker struck.",
    "Ms Masson went to her partner with another witness who saw blood coming from his ear and nose. Emergency services were called.",
    "Police identified Bennett who was arrested at home.",
    "Defence counsel Lorenzo Alonzi argued that it was an \"exceptional case\" and called for his client to be given an alternative sentence.",
    "He said that for Bennett \"this whole incident is a matter of deep regret\", and he is \"a young man with still some maturity to gain.\"",
    "Judge Lord Arthurson said Bennett had expressed remorse and has a good employment history.",
    "But he said a custodial sentence was required for a crime which had truly catastrophic consequences.",
    "\"The impact of your crime on him has been life changing,\" he said."
  ],
  "predictedGuesses": 57
}