{
  "headline": "Residents still unable to go home after collapse",
  "date": "17 December 2025",
  "content": [
    "Bradford Council said it was the responsibility of the building's owner to investigate why it collapsed",
    "Residents who were evacuated from their homes in the centre of Bradford following the collapse of a nearby building have not yet been able to return to their properties.",
    "The derelict building on Dale Street fell down on Monday morning, spilling debris onto the road and leading to people living in an adjacent property being moved out.",
    "They have not been allowed to return to their homes because a restriction notice has been issued by the fire service due to the collapse affecting their building's fire escape.",
    "Bradford Council said the landlord was working to find alternative accommodation for affected tenants, meanwhile Dale Street remained closed. ",
    "The authority said it had also been liaising with representatives of the owner of the building which collapsed.",
    "A Bradford Council spokesperson said it was the owner's responsibility to ensure the site was safe and also to make arrangements for any demolition work to take place.",
    "Emergency crews were called to the scene on Monday morning ",
    "It is not yet known when the road will reopen",
    "The spokesperson explained: \"They have now fenced the area off and they are in the process of appointing a contractor for any work needed.",
    "\"Along with the responsibility for any demolition, the building owners are also responsible for any investigation work to determine the cause of the collapse.\"",
    "The council said building owners were \"solely responsible for ensuring they keep their buildings maintained and in a safe condition\", but added that the authority \"did inspect the condition of buildings that are reported to us\".",
    "The spokesperson added: \"At this stage we can't say exactly how long Dale Street will remain closed, but it will only be reopened once safe to do so.\""
  ],
  "predictedGuesses": 51
}