{
  "headline": "Steering group seeks proposals for clifftop building",
  "date": "17 December 2025",
  "content": [
    "Ventnor Winter Gardens is currently in poor condition",
    "A steering group has been formed to explore future options for a clifftop art deco building on the Isle of Wight.",
    "Ventnor Winter Gardens, which is currently in poor condition, was recently confirmed as an Asset of Community Value (ACV).",
    "The building is owned by the Hambrough Group, which runs a hotel in the town.",
    "A steering group member said: \"We are approaching this openly and constructively, and we want to hear from any parties who may be interested in forming a viable, community-focused bid.\"",
    "They said the ACV was a \"unique opportunity - but it is time-limited\".",
    "The BBC understands the current owner has informed Isle of Wight Council of its intention to sell.",
    "The art deco building was recently confirmed as an Asset of Community Value",
    "In a statement, the steering group said: \"No price has been disclosed and no sales details have yet been released by an agent, meaning the process will be challenging.",
    "\"Nonetheless the steering group believes now is the moment to act, if there is a possibility to influence the outcome.\"",
    "The group was formed following public meetings earlier this year to gather local opinion, which found that the Winter Gardens had not \"meaningfully served the interests of local people for some time\". ",
    "It is seeking expressions of interest from individuals, groups or organisations to develop proposals for the building, which originally opened in 1936.",
    "Plans to turn it into an ACV received backing from Ventnor Town Council in August.",
    "According to the community right to bid policy, once an asset is listed as having community value, its owner cannot dispose of it - until interested community groups have had a chance to register interest in purchasing.",
    "Do you have a story BBC Hampshire & Isle of Wight should cover?"
  ],
  "predictedGuesses": 53
}