{
  "headline": "Stephen Lawrence killer David Norris denied parole",
  "date": "16 December 2025",
  "content": [
    "Stephen Lawrence murderer David Norris has been denied parole.",
    "He had sought release during a parole hearing in October, having been jailed in 2012 over the 18-year-old's killing.",
    "Stephen was stabbed to death in a racist attack in south London in 1993. Police failings in the investigation into his killing made the case notorious and led to the Metropolitan Police being branded \"institutionally racist\" by a public inquiry.",
    "Only two of his killers - including Norris - have been convicted. Police have always maintained six people were involved.",
    "Stephen's mother, Baroness Doreen Lawrence, said Norris remained \"a dangerous racist who should never be let out of prison\".",
    "She added: \"He was a coward who completely failed to acknowledge the life he took or the deep and lasting impact his actions have had on my family and me.\"",
    "Norris's parole bid came 13 years after he was jailed for life with a minimum sentence of 14 years and three months.",
    "Stephen was stabbed to death by a gang as he waited at a bus stop in Eltham, south-east London. ",
    "The case gained national attention as the Met failed to properly investigate the five prime suspects in the case, with only two - Norris and Gary Dobson - finally being convicted in 2012. ",
    "The other suspects remain free.",
    "Norris admitted to being part of the attack at the hearing in October, but refused to name the other killers. He had previously denied involvement.",
    "He said he was the last person to punch Stephen. He had tried to hit him two or three times and one of his punches connected.",
    "For decades, Norris had publicly denied involvement in the murder, giving no-comment interviews to police and claiming he was innocent during his trial.",
    "However, the hearing heard confirmation that he had admitted involvement since being in prison, but denied stabbing Stephen or using a knife.",
    "Baroness Lawrence called his parole application \"a gross manipulation of the process\".",
    "She said in a statement after the parole board's decision that she had hoped the hearing would reveal who delivered the \"fatal blows\" to her son, but that she had been \"cruelly deprived of that knowledge\".",
    "Norris had put her through \"two days of anguish\" despite knowing he could have given her a \"crumb of comfort\", Baroness Lawrence, now a peer and a campaigner, said.",
    "\"It was evident that he showed no remorse for his actions or for the pain he had caused to my family and to those who cared for Stephen. My fight for justice is not over, but today's decision is a step in the right direction.\"",
    "Both she and the justice secretary had opposed Norris's release.",
    "Stephen Lawrence was murdered in a racist attack in 1993, when he was 18",
    "An extreme racist slur had been used towards Stephen just before the gang attacked, according to witness evidence given at Norris's trial.",
    "Norris gave evidence to his parole hearing - in which he was bidding for release on licence - via a video link from prison.",
    "The hearing also heard Norris continued to use racist language in prison, with him having been recorded in 2022 using the same racial slur that was hurled at Stephen before the fatal stabbing.",
    "In a prepared statement that Norris read out, he apologised to the Lawrence family and wider black and ethnic community for the \"fear\" and \"horror\" his role in the attack had caused.",
    "In a statement read on her behalf, Baroness Lawrence said Norris had \"killed my son in the most brutal and callous fashion\".",
    "She said she could not forgive Norris because he has not \"expressed any acceptance, any contrition and certainly has no humanity\".",
    "Stephen's father previously told the BBC that Norris should name the other killers before he could be judged to be safe for release from prison.",
    "The Met Police ended its murder investigation in 2020, but a BBC investigation led to an independent review of the case, which began in September."
  ],
  "predictedGuesses": 63
}