{
  "headline": "'Dangerous levels of violence' at prison ",
  "date": "17 December 2025",
  "content": [
    "Inspectors have issued the Justice Secretary with an urgent notice to act over Swaleside Prison",
    "A prison with \"dangerous levels of violence\" which created a \"sense of despair\" has been placed under emergency measures by a watchdog.",
    "Swaleside Prison on the Isle of Sheppey, in Kent, was described as \"filthy\", with \"dilapidated flooring and mouldy showers\", by HM Inspectorate of Prisons, who visited earlier this month.",
    "Chief Inspector of Prisons Charlie Taylor has issued an urgent notification to the government, which requires a response and action plan within 28 days.",
    "Prisons minister James Timpson said work was being carried out to \"rapidly reduce violence, improve safety and drive up standards\" at Swaleside.",
    "Inspectors said Swaleside, a Category B prison, had one of the highest rates of violence for prisons in England and Wales, with six men assaulted or stabbed during the first night at the jail during 2025 so far.",
    "Inspectors said a third of inmates told them they feel unsafe, and drugs and knives were often smuggled in by drones.",
    "Officers, many lacking experience, were \"failing to impose order and control\". Many were \"burnt out and demoralised\", inspectors added.",
    "Inspectors described the prison as \"filthy\" and \"dangerous\"",
    "The watchdog said the situation had been made worse by there having been no permanent governor for several months in 2024 and 2025.",
    "Some prisoners had barely more than an hour each day out of their cells, and others were too frightened to keep health care appointments or use the gym.",
    "Mr Taylor said: \"The current governor had only been in post for five months and although she was supported by her staff and had developed plans for improvement, there had been little progress in addressing serious challenges.",
    "\"Many hardworking staff were doing an impressive job in extremely difficult circumstances, but during our inspection we were very troubled by a palpable level of tension and a pervasive sense of despair in the jail.",
    "\"The appalling outcomes we found at Swaleside, holding some of the most dangerous men in the country, represent serious failings by leaders in the prison service to address the systemic problems at this troubled jail.\"",
    "Andrea Coomber, chief executive of the Howard League for Penal Reform, said: \"Swaleside is supposed to be a training prison for men on long sentences that keeps the public safe and gives people the skills and support they need to move on from crime.",
    "\"But the dismal findings from this inspection reveal the opposite – violence is rife, the men are unsafe, held in squalor, and there are shocking gaps in public protection.\"",
    "Minister for Prisons, Probation and Reducing Reoffending, Lord Timpson, said: \"This is a deeply concerning report and I'm disappointed we have failed to achieve the required standard. ",
    "\"I know the new Governor and her talented team are already working hard to address the serious concerns it raises, which has been recognised by the Chief Inspector.\"",
    "Lord Timpson said the government will publish an action plan in the coming weeks to support the prison's leadership team."
  ],
  "predictedGuesses": 55
}