{
  "headline": "Hospice hosts 'whirlwind' wedding for happy couple",
  "date": "17 December 2025",
  "content": [
    "Mark Brennan and Joyce Taylor had a ceremony inside LOROS Hospice's social area",
    "A man who checked into a hospice expecting to see out his final days has instead got married there and been told he can return home.",
    "Mark Brennan, 64, spent months in and out of hospital with serious infections and most recently following a fall. After taking a turn for the worse, doctors believed he would die, so he was moved to LOROS Hospice in Leicester.",
    "But after his condition began to improve there, his partner Joyce Taylor proposed. A wedding was arranged within days and held inside the Groby Road hospice.",
    "Rather than walking down the aisle, Mark was instead wheeled into the hospice's social area in his bed for the ceremony on Tuesday as Always Look on the Bright Side of Life played.",
    "Staff helped to decorate the hospice for the big day",
    "Joyce, 74, said the wedding planning had been \"an absolute whirlwind\" and arranged in a matter of days.",
    "A registrar, cake and hair and make-up for the bride were organised by LOROS, while the hospice secured a grant to cater for the couple's family and friends. Staff also decorated Mark's room.",
    "Joyce said the pair had met via online dating.",
    "She said: \"We talked for hours on the phone and I've never looked back. He was so funny, he really made me laugh and was full of funny stories.\"",
    "LOROS staff helped the couple to tie the knot",
    "But the couple's recent experiences have included Mark's ill health. He was diagnosed with Parkinson's in May and spent several months in and out of hospital.",
    "Joyce said: \"The doctors thought he would die - that's why he came to LOROS. He wasn't eating and was barely drinking.",
    "\"But at the hospice, he started to improve. I can't tell you the difference, he's talking and he's himself again. In two weeks at LOROS, Mark was able to sit up and eat a roast dinner.",
    "\"I decided to seize my chance. I got down on one knee and proposed. He said 'about bloody time'.\""
  ],
  "predictedGuesses": 56
}