{
  "headline": "Ukraine in maps: Tracking the war with Russia",
  "date": "24 February 2022",
  "content": [
    "Ukraine in maps: Tracking the war with Russia",
    "Fighting has raged in Ukraine since Russia launched a full-scale invasion more than three years ago. Over the past year, Russian forces have slowly expanded the amount of territory they control, mostly in the east of Ukraine, and have continued their recent barrage of air strikes on Kyiv and other cities.",
    "With the fourth anniversary of the invasion approaching, here's a look at the situation on the ground in Ukraine.",
    "Analysts at the US-based Institute for the Study of War (ISW), say Russia has taken about 4,700 sq km (1,800 sq miles) of territory in 2025 - an area about twice the size of the city of Moscow - although Russia claims to have taken 6,000 sq km.",
    "In eastern Ukraine, Moscow's war machine has been churning mile by mile through the wide open fields of the Luhansk and Donetsk regions - also known as the Donbas - surrounding and overwhelming villages and towns.",
    "It has been trying to gain full control of the area along with two more regions to the west - Zaporizhzhia and Kherson. Shortly after the invasion, Russia held referendums to try to annexe all these regions - in the same way it had annexed Crimea in 2014 - but it has never had them under full control. ",
    "Under a US-backed peace plan unveiled in November, Ukraine would cede control of all of Luhansk, Donetsk and Crimea, along with the areas of Zaporizhzhia and Kherson that Russia currently occupies, to Moscow.",
    "Ukrainian forces would have to withdraw from parts of Donetsk they still hold and this would become a demilitarised area under de facto Russian control. Russian forces would withdraw from the small areas of Ukraine they currently occupy outside those regions.",
    "Ukraine's President Volodymyr Zelensky has consistently said Ukraine will not hand over the Donbas in exchange for peace, saying such a concession could be used as a springboard for future attacks by Russia. ",
    "A recent report by the ISW describes a \"fortress belt\" running 50km (31 miles) through western Donetsk.",
    "\"Ukraine has spent the last 11 years pouring time, money, and effort into reinforcing the fortress belt and establishing significant defence industrial and defensive infrastructure,\" it writes.",
    "A Russian summer offensive near the eastern town of Pokrovsk did make rapid advances just north of the town and Russia has recently made advances in the south of the town itself and to the east of nearby Kostyantynivka.",
    "The town, once a key logistics hub for Ukraine's military, is already in ruins.",
    "Russian officials claim to have captured the key strategic town, known in Russian as Krasnoarmeysk, which could give Moscow a platform to drive north towards the two biggest remaining Ukrainian-controlled cities in the Donetsk region, Kramatorsk and Slovyansk.",
    "Ukraine is losing ground, but the ISW notes Russia has been trying to take Pokrovsk - a town of about 23 sq km - for nearly two years and that cities in the fortress belt are \"significantly larger\". ",
    "It suggests that it would take Russian forces another two years to seize the remainder of the Donetsk region \"at great cost\".",
    "Why Donetsk 'fortress belt' matters so much for Ukraine's defences",
    "Four key takeaways from Ukraine talks in Washington",
    "Why did Putin's Russia invade Ukraine?",
    "Further north on the main front line, Russia has been trying to advance on the city of Kupyansk, which analysts suggest could allow it to encircle the northern Donetsk region.",
    "It has also been trying to push Ukrainian forces back from the border with the Russian region of Belgorod.",
    "ISW analysts say Russia is trying to create a buffer zone inside Ukraine's northern borders and get within artillery range of Kharkiv, Ukraine's second-biggest city.",
    "Russian President Vladimir Putin says he wants this buffer zone to protect Russia, after Ukrainian forces captured a swathe of territory further north in Kursk in the summer of 2024. Russian forces eventually drove them out, with the help of North Korean troops.",
    "As well as the counter-offensive in the Kursk region, Ukraine has struck air bases deep inside Russia. One of these attacks involved using 100 drones to target nuclear-capable long-range bombers.",
    "The Russian Defence Ministry confirmed the attacks had occurred in five regions of Russia - Murmansk, Irkutsk, Ivanovo, Ryazan and Amur - but stated planes had been damaged only in Murmansk and Irkutsk, while in other locations the attacks had been repelled. ",
    "More recently Moscow blamed Ukrainian drones for a massive oil depot fire near Russia's Black Sea resort of Sochi - the venue of the 2014 Winter Olympic Games.",
    "Deep strikes are seen as a critical part of the war - Ukraine is trying to target Russia's war economy to slow the advances on the front line.",
    "The head of Ukraine's Armed Forces, General Oleksandr Syrskyi, says Ukraine's long-range strikes have already cost the Russian economy more than $21.5bn this year.",
    "Since US President Donald Trump took office at the start of 2025, the US has been pursuing an end to the war through negotiations.",
    "Trump had been seen as more sympathetic to Russia than his predecessor Joe Biden was, and strained relations with Zelensky came to a head on 28 February when he and Vice-President JD Vance berated the Ukrainian president in the Oval Office on live television.",
    "Public relations with Zelensky have vastly improved in recent months and Ukraine remains critically dependent on deliveries of US-made advanced weaponry, including air defence systems to repel deadly Russian air assaults, as well as intelligence provided by Washington.",
    "Ukraine has presented its own 20-point peace plan to the US, to counter the initial American plan which was seen as heavily favouring Russia.",
    "Details haven't been shared, but last week Zelensky said the points should be seen as a \"foundation\" on which to build provisions for the reconstruction of Ukraine and security guarantees.",
    "However, the Kremlin has shown little sign that it is willing to compromise on its key demands, including ruling out any future path to Ukraine joining the Nato military alliance. ",
    "Putin has also restated his willingness to continue fighting until his forces take full control of the Donetsk and Luhansk regions.",
    "Russia's full-scale invasion began with dozens of missile strikes on cities all over Ukraine before dawn on 24 February 2022.",
    "Russian ground troops moved in quickly and within a few weeks were in control of large areas of Ukraine and had advanced to the suburbs of Kyiv.",
    "Russian forces were bombarding Kharkiv, and had taken territory in the east and south as far as Kherson, and surrounded the port city of Mariupol.",
    "But they hit very strong Ukrainian resistance almost everywhere and faced serious logistical problems with poorly-motivated Russian troops suffering shortages of food, water and ammunition.",
    "Ukrainian forces were also quick to deploy Western supplied arms such as the Nlaw anti-tank system, which proved highly effective against the Russian advance.",
    "By October 2022, the picture had changed dramatically and, having failed to take Kyiv, Russia withdrew completely from the north. The following month, Ukrainian forces recaptured the southern city of Kherson.",
    "Since then, the battle has mostly been in the east of Ukraine with Russian forces slowly gaining ground over many months - military experts estimate between 165,000 and 235,000 Russian service personnel have been killed since the invasion.",
    "Ukraine last updated its casualty figures in December 2024, when President Zelensky acknowledged 43,000 Ukrainian deaths among soldiers and officers. Western analysts believe this figure to be an under-estimate.",
    "By Dominic Bailey, Mike Hills, Paul Sargeant, Chris Clayton, Kady Wardell, Camilla Costa, Mark Bryson, Sana Dionysiou, Gerry Fletcher, Kate Gaynor and Erwan Rivault",
    "To indicate which parts of Ukraine are under control by Russian troops we are using daily assessments published by the Institute for the Study of War, external with the American Enterprise Institute's Critical Threats Project, external.",
    "The situation in Ukraine is often fast moving and it is likely there will be times when there have been changes not reflected in the maps."
  ],
  "predictedGuesses": 75
}