{
  "headline": "Giant menorah lit as Plymouth Jewish CIC launches",
  "date": "17 December 2025",
  "content": [
    "Candles were lit to mark the four nights of Hanukkah which have passed since the holiday began",
    "The lighting of a giant menorah has taken place in Plymouth to coincide with the launch of a community interest company (CIC) by and for Jewish people.",
    "The Plymouth Jewish Community CIC was founded to become the home of Jewish culture and conversation in the city, organisers said. ",
    "At the event, candles were lit by Rabbi Mendy Singer to mark the four nights of Hanukkah which had passed since the holiday began on Sunday.",
    "Tom Godwin, one of the directors of the CIC said the organisation hoped to \"build a community among Jewish people who feel isolated\".",
    "Mr Godwin said: \"Hanukkah is all about light, shining a light in the darkness publicly. ",
    "\"I think that's quintessentially why we felt it important to launch the CIC on this day. ",
    "\"We want Jewish life in Plymouth to be a bit more present, assertive, and for people to be proud and safe.",
    "\"It feels really important that the Jewish community regionally know we're doing that work, working with people, building ally-ship and creating new networks so they don't have to hide.\"",
    "The Shamash and four candles were lit by Rabbi Mendy Singer",
    "In the aftermath of Sunday's shooting attack at Bondi beach, Mr Godwin added that the Jewish community in the city were \"rightly very nervous, but not surprised\".",
    "\"We've spent another Jewish holiday dealing with the aftermath of a horrific murder of innocent Jews,\" he said.",
    "\"There is something about the resolve of people who came out tonight.",
    "\"I think there's a feeling amongst people that they want to stand alongside Jewish individuals here to say we won't be cowered by those that seek to do us harm.",
    "\"There is a lot of work to do around making Jews in this country feel safe,\" he added.",
    "Rabbi Mendy Singer said he felt \"so blessed for Plymouth to get together\".",
    "\"Everyone is feeling the importance to stand together, to connect, to celebrate our identity as a community,\" he said.",
    "The Rabbi, from Chabad of Bristol, added the the menorah's lights represented \"the victory of light over darkness in the face of evil and hatred\".",
    "The Hanukkah ceremony in Plymouth marked the first year the event was hosted by Plymouth Jewish Community CIC in partnership with Chabad of Bristol. ",
    "The eight-day festival ends on 22 December, when all the candles on the menorah are lit."
  ],
  "predictedGuesses": 56
}