{
  "headline": "Staff played football with toilet roll - inquest",
  "date": "17 December 2025",
  "content": [
    "Matthew Osborne was found in his cell about two hours after prison officers were seen playing football with a toilet roll",
    "Two prison officers were seen playing football with a toilet roll two hours before an inmate died in a jail in Nottinghamshire.",
    "An inquest into the death of Matthew Osborne, at HMP Lowdham Grange on 25 November 2023, was played CCTV footage from the segregation unit where he had been held since 3 October that year.",
    "On Wednesday, jurors at Nottingham Coroner's Court were told numerous checks on the 39-year-old were recorded in prison systems, but were not actually carried out.",
    "Osborne was the fifth inmate at the Category B jail to be found hanging in his cell in 2023.",
    "The court previously heard Osborne was a known suicide risk and was subject to checks under a procedure known as assessment, care in custody and teamwork (ACCT).",
    "He was supposed to be checked three times per hour, but on the day of his death there were 12 occasions when ACCT checks had been recorded but CCTV footage showed prison staff had not been to his cell.",
    "Osborne also rang his cell bell five times between 09:00 GMT and 12:15 on 25 November, but despite prison policy saying these should be responded to within five minutes, none were addressed within the required time period.",
    "Three ACCT checks were completed between 13:00 and 14:00, when an officer from another part of the prison was covering while two officers on the segregation unit had a lunch break.",
    "The last ACCT check took place at 13:56, and while another was recorded in the system as taking place 10 minutes later, CCTV showed it did not occur.",
    "At 14:23, area coroner Laurinda Bower told the jury the two officers on duty on the segregation unit \"can be seen playing football with a toilet roll\".",
    "Osborne was last seen alive at 14:31, when an officer and a mental health nurse looked through his cell door's observation hatch.",
    "He was found hanging at 16:22, with a code blue called soon afterwards, but he was declared deceased by ambulance staff at about 17:20.",
    "Osborne had been transferred to HMP Lowdham Grange on 20 June 2023",
    "Det Con Sarah Kirk, from Nottinghamshire Police, said the force was called at about 17:30, and arrived two hours later to investigate in line with standard procedure for deaths in custody.",
    "She said when she arrived she was not told earlier ACCT checks had been recorded but not carried out, but this emerged when prison systems were cross-referenced with CCTV.",
    "Det Con Kirk said prison staff had denied deliberately ignoring Osborne on the day of his death, but said one officer said they emailed a manager to complain about low levels of staffing on the segregation unit on 24 November.",
    "\"None of them said it was deliberate, they were saying staffing was responsible [for being unable to carry out roles effectively],\" she said.",
    "When asked by Ms Bower how staff could find time to play football on the unit if staffing levels were low, Det Con Kirk said: \"I think by the time we had seen that footage, we had already taken statements from them.\"",
    "The inquest continues.",
    "If you have been affected by the contents of this article, support can be found via the BBC Action Line"
  ],
  "predictedGuesses": 60
}