{
  "headline": "'They look hideous' - Battle over the Irish flag on Dublin streets",
  "date": "17 December 2025",
  "content": [
    "Irish tricolour painted on a gable wall in East Wall in north Dublin",
    "Irish tricolour flags have been erected on street lights all over Dublin in recent months in what has been branded by some as an anti-immigration campaign.",
    "Several politicians and anti-racism activists have accused those putting up the flags of marking territory and intimidating tactics.",
    "Far-right individuals, as well as members of local communities, have posted videos of flag raising online, but anti-immigration groups have denied the actions are racist.",
    "In most cases, the flags are put up without the proper permission from Dublin City Council - but the council has said it will not take them down, as it would be \"counterproductive\".",
    "Irish flags flying in north Dublin city ",
    "Some local residents have raised concerns. ",
    "In emails to one councillor, seen by BBC News NI, locals expressed \"concern and dismay\" and said the flags were \"intimidating and divisive\" because they have been put up as part of an \"'Irish-only or anti-immigrant message\".",
    "Locals also asked for the flags to be \"immediately removed\" as they were put up as part of a \"bad faith\" anti-immigrant campaign associated with far-right elements.",
    "Now a counter-campaign seeking to \"reclaim\" the Irish flag has been launched, called #OurFlag.",
    "One of the organisers, broadcaster and psychotherapist Dil Wickremasinghe, said it was started as a response to those who aim to \"intimidate and create an atmosphere of unwelcome\" by \"weaponising the flag\".",
    "Broadcaster, journalist and psychotherapist Dil Wickremasinghe says the #OurFlag campaign aims to reclaim the tricolour as a \"symbol of unity\"",
    "She said she bought a home this year and the area has now been \"overrun\" by flags.",
    "She explained how after the Dublin riots in 2023, her six year old son came home from school and said he was told he may need to leave Ireland or he may \"get stabbed\".",
    "\"Those words coming out of my six year old's mouth was a defining moment in my life in Ireland, because this was a place that provided me with safety and security for 25 years where I could be myself.\"",
    "She said the new campaign to reclaim the flag aimed to use the tricolour as \"a symbol of unity to bring us all together\".",
    "But those who support the flag campaign reject it is being put up because of anti-immigration reasons.",
    "\"We're marking our territory because this is our nation, and we're marking our nation and people, why are people afraid of a nation and the citizens of a nation flying their flag?\" said Independent Dublin City councillor Malachy Steenson.",
    "The councillor said while he has not put up flags himself, he is in support of those who are doing so.",
    "\"Our team has done it, yes, and we take full responsibility and acknowledge that it's our team,\" he added.",
    "Dublin City Independent Councillor Malachy Steenson says he is in support of flying the flags",
    "He said he did not want to see \"any other flags\" flying, such as the \"European rag\", the pride flag or \"any political flag\".",
    "\"People can do that in their own houses. State buildings should only have one flag. Our streets should only have one flag, and that's our tricolour.\"",
    "He rejected claims from some locals that flying the flag was racist.",
    "\"It's the most inclusive flag you can have, green, white and orange, unity of Catholic, Protestant and the centre of the common name of Irishmen.",
    "\"How is it racist? How can it be racist to fly your own flag in your own country?\"",
    "Social Democrat Dublin City councillor Cat O'Driscoll said there was \"great concern\" by locals over why the flag is being put up.",
    "\"The main concern is that it is an anti-immigration campaign, that it's telling people this area has flags, and it's only for the Irish,\" she said.",
    "A mural with the words \"North Strand welcomes all\" has now been painted along the North Strand Road as a counter to the tricolour campaign.",
    "A welcoming mural has now been painted along the North Strand Road as a counter to the tricolour campaign",
    "The Irish tricolour has been used by anti-immigration protesters over migrant housing in recent years around Ireland.",
    "Although flags and murals are not unusual in Northern Ireland, this is the first time the flag has been put up on poles across city streets in the Republic without plans to be taken down.",
    "Professor of Social Anthropology at Queen's University Belfast, Dominic Bryan, said a similar pattern of putting flags on lamposts had been used by those with anti-immigrant views in parts of the UK.",
    "\"We've seen the same in England and Scotland and Wales, in fact, as well as in the Republic of Ireland,\" he said.",
    "\"But it does suggest, similar to Northern Ireland, that it is also a sense of coercive control.",
    "\"Whilst it's on the one hand, seems to be a sense of patriotism, there is also a level of threat that comes with that practice. And interestingly, because it's the national flag, authorities are very unwilling to go and take those flags down.\"",
    "Michael Kennedy feels that flags can \"downgrade\" an area",
    "Michael Kennedy works in the East Wall area in north Dublin city, where flags have popped up.",
    "\"I work around the area. Most of my family are from Northern Ireland, so I'm aware of what flags could mean, their symbolism,\" he said.",
    "\"I personally find that they can downgrade the look of an area.",
    "\"I don't believe any nation's flag should be on any lamppost, which is public street furniture. I do think they look hideous, especially when they are raised in such a haphazard way.\"",
    "A spokesperson for Dublin City Council said the council \"has engaged with stakeholders and reviewed the factors and risks associated with the ongoing issue of flags on public lighting poles\". ",
    "\"Following this, the council has concluded that removing such flags at this time would be counterproductive.",
    "\"Instead, the council will take a positive and proactive approach. One that celebrates our collective sense of belonging to this city.\"",
    "The council said it would work with local communities to promote \"a deeper understanding of the Irish flag - its history, its meaning\" and that it would remove items placed on public lighting poles if they \"create a hazard or risk\"."
  ],
  "predictedGuesses": 65
}