{
  "headline": "Tokyo couple die in sauna fire after being trapped inside",
  "date": "1 hour ago",
  "content": [
    "Private saunas are very popular in Japan [file image]",
    "A husband and wife have died after being trapped in a private sauna room that caught fire in Japan on Monday.",
    "Tokyo police are investigating whether a faulty doorknob trapped the couple inside the room at Sauna Tiger, in the city's Akasaka district, local media has reported.",
    "Investigators also found that the facility's emergency alarm system was switched off, and allegedly had been for two years.",
    "\"We offer our deepest condolences... and our heartfelt sympathies for the deep grief and pain that cannot be expressed in words,\" Sauna Tiger said in a statement on its website.",
    "The victims have been named by local media as Yoko Matsuda, a 37-year-old nail artist, and her husband Masanari, 36, who ran a beauty salon.",
    "The fire department was called at around 12:25 local time (03:25 GMT) on Monday, when the facility's fire alarm went off. When firefighters arrived, the sauna's doorknob was on the floor, investigators told Japanese media.",
    "The couple were found collapsed on the floor on top of each other, with their heads near the door, local media reported. They were rushed to hospital, but later died.",
    "A burnt towel was reportedly found inside the sauna, indicating that the fire may have been caused by the towel touching hot sauna stones, police said.",
    "The sauna room had an emergency alarm on the wall to alert staff if help was needed, but investigators found it had been switched off. The alarm's cover had been removed, however, indicating that the couple had likely been pressing it to call for help, the Metropolitan Police Department said.",
    "Police added that when staff were questioned about the alarm, they allegedly said it had not been switched on \"since around 2023\", local media reported.",
    "The Minato Public Health Centre told The Asahi Shimbun newspaper that the sauna had been in operation since July 2022, and was last inspected in April 2023, when \"no major deficiencies [were] found in the equipment\".",
    "Saunas have become increasingly popular in Japan, with many facilities offering private rooms. But there has also been a rise in sauna-related accidents, prompting calls for the industry to be more strictly regulated.",
    "In its statement, Sauna Tiger said it was taking the incident \"very seriously\" and \"cooperating fully with the investigations by the fire department\".",
    "It added that Sauna Tiger would be \"closed for the time being\" and offered refunds to any customers with reservations."
  ],
  "predictedGuesses": 60
}