{
  "headline": "Beach bar shut over cliff step safety 'devastated'",
  "date": "17 December 2025",
  "content": [
    "The Grotto's area manager Phil Steel said the restaurant had to cancel Christmas bookings",
    "A beach bar and hotel says its forced closure has been a \"devastating blow\" after the stairs leading down to it were deemed unsafe.",
    "The Grotto in Marsden, South Shields, was served a prohibition notice by the fire service because the council-maintained steps are the only official means of escape. ",
    "The venue's area manager Phil Steel said Christmas bookings had to be cancelled and staff were in limbo over the uncertainty. He said: \"The business is sitting here unused, empty, and the overheads are still there.\"",
    "South Tyneside Council said it would support the venue and had arranged inspections to understand what remedial works might be required on the steps.",
    "The venue on Marsden beach can be accessed either by a lift from the cliff top, or via stairs down the cliff face.",
    "The council shut the Marsden Grotto steps on 4 December, then the Tyne and Wear Fire and Rescue service (TWFRS) forced the venue to close on 10 December, due to \"inadequate means of escape in the event of fire\".",
    "Mr Steel, who is the area manager for Hotels International which runs and operates The Grotto, said it was \"absolutely shocking\" to get the news a couple of weeks before Christmas.",
    "TWFRS said it had met with The Grotto's owners and was working with them to find a solution.",
    "The beach-front venue can be accessed by a lift or steps down the cliff face",
    "Mr Steel said: \"That's it. It's just closed. No more money in the till.",
    "\"It's a devastating blow.\"",
    "He believed the closure could have been avoided, but the stairs had been \"so poorly looked after\".",
    "\"They've [the council] had ample opportunity to do something before it got to this stage,\" Mr Steel said.",
    "Councillor Ernest Gibson, lead member for neighbourhoods, said the closure was \"not a question of neglect\".",
    "\"They [the steps] are constantly exposed to the elements, including storm tides and saltwater, which inevitably take their toll over time,\" Gibson said.",
    "He said the council carried out routine inspections and maintenance, and the latest inspection uncovered safety concerns that required it to close the steps.",
    "The council said the closure was \"not a question of neglect\"",
    "Mr Steel said the business would \"be into tens of thousands already\" in losses.",
    "The Redwell Bank steps further along the beach are affected by the tide.",
    "The venue believed an appeal process with the fire service could take months, and said no timeline had been given for repairs by the council.",
    "\"It couldn't have come at a worse time of year,\" Mr Steel said.",
    "Do you have a story suggestion for BBC Tyne?"
  ],
  "predictedGuesses": 60
}