{
  "headline": "Petition started to protect city market's pigeons",
  "date": "18 December 2025, 06:43 GMT",
  "content": [
    "Summer Loh believes instead of eating food scraps, the pigeons should be given a nutritious food source",
    "A petition has been started to protect pigeons roosting near Norwich Market while the council explores ways to control the number of birds in the area. ",
    "Norwich City Council has urged people to stop feeding pigeons at the city's war memorial and market after spending £4,000 on hawks to deter pigeons and gulls. ",
    "Summer Loh, 19, said the pigeons should be given a food source in the city and the markets should be cleaned regularly to tackle the amount of droppings. ",
    "Carli Harper, a Labour councillor and cabinet member for finance and major projects, said the authority was considering bringing in fixed penalty notices to stop people from feeding pigeons, which she said was \"hindering the market\".",
    "More than 1,200 people have signed the petition, which was created by Ms Loh, calling for the birds to be given a better place to nest.",
    "Ms Loh, a university student, believed an abandoned public bathroom in Chapelfield Gardens could be repurposed into a dovecote and rehabilitation office.",
    "\"I was a fan of the pigeons before that, but when the discussion about the hawk started, I got very passionate about it,\" she said. ",
    "One of the complaints is the amount of bird droppings at Norwich Market and on the war memorial",
    "Ms Loh believed the areas around the markets should be cleaned regularly.",
    "\"The reason [the pigeons] go into the market is it's a source of food and if people were to be banned from feeding them outside the market it would mean their only available source of food would be dropped scraps,\" she added. ",
    "Ms Loh said she has seen a number of sick pigeons in the city and said a lack of diet leads to the bird's droppings to be more acidic. ",
    "\"A lot of people consider them to be vermin now which I don't think is very fair... we should treat them like any animal and consider them as lives because that's what they are. ",
    "\"Innocent lives that deserve to be treated with respect and compassion,\" she added. ",
    "Carli Harper said the city council is looking at bringing in tougher measures to deter people from feeding the birds",
    "\"We know from traders they are fed up with having stock ruined, their stalls disrupted by pigeons that are roosting where they are trying to trade and it is a big challenge so we do need people to stop feeding the pigeons,\" Harper said. ",
    "\"We are just saying don't do it on our war memorial. Don't do it on a market that is roughly 50% food stalls.\" ",
    "While the city council said it has already tried to engage and educate people on the issue, it was looking at taking tougher measures. ",
    "Harper said: \"This isn't natural behaviour for pigeons, they are being encouraged by people, people who are bringing food in commercial quantities to the war memorial. ",
    "\"The efforts to clear up the pigeon poo from the war memorial, we are fighting a losing battle at the moment,\" she added. ",
    "Do you have a story suggestion for Norfolk?"
  ],
  "predictedGuesses": 57
}