{
  "headline": "'Hero' honoured at Christmas tree festival",
  "date": "16 December 2025",
  "content": [
    "Lisa Wilson said she is so proud of her son's legacy ",
    "A \"hero\" who saved nine lives through donating his organs has been honoured at a Christmas tree festival with a special display.",
    "To mark the ten-year anniversary since Tom Wilson's death, his mother Lisa Wilson has made baubles featuring his face to hang in his hometown's church.",
    "Tom, from Barnstaple in Devon, died after being hit on the back of the head with a hockey stick during a training session at the age of 22.",
    "His decision to sign up as a donor resulted in 50 people receiving crucial organ and tissue donations, his mother added.",
    "She said: \"Tom was hit on the back of the head and immediately knocked unconscious and rushed to hospital.",
    "\"We were told that there wasn't anything anybody could do for Tom because he had had such a severe brain haemorrhage.\"",
    "Tom died following a rare accident at a hockey training session in 2015",
    "He had signed up before the new opt-out system came into force in England in May 2020, which means adults are considered to be a donor unless they opt-out.",
    "However, despite Tom signing up, his mum and dad still had to approve his organs being donated.",
    "Ms Wilson said: \"We could have said 'no' but Tom had communicated his wishes by signing the register and of course we said 'yes'.\" ",
    "She added Tom had helped save and improve the lives of 50 people through his organ and tissue donation.",
    "\"Tissue can be tendons, it can be skin to help people with horrific skin burns,\" she added.",
    "Fatima was two when she received an organ donation from Tom",
    "Tom transformed 41 lives and saved nine - including 12-year-old Fatima, who received part of Tom's liver when she was two.",
    "\"If it wasn't for Tom, I probably won't be here right now,\" she said.",
    "Her mum Lubna said: \"He's a hero. We were so, so lucky because it's very hard to get a donated organ and Tom's came at the right time, we'll forever be grateful.\"",
    "Tom's ten-year anniversary tree is on display at St Peter and St Mary Magdalene Parish Church as part of the venue's Christmas Tree Festival.",
    "\"I'm so proud of Tom, that's why he's on top of the tree – he is a star,\" Ms Wilson added."
  ],
  "predictedGuesses": 52
}