{
  "headline": "Murdered girl mum unhappy with domestic exclusion",
  "date": "50 minutes ago",
  "content": [
    "Holly Newton was stabbed hours before a scheduled meeting with police to discuss her family's concerns about the killer",
    "A woman whose 15-year-old daughter was murdered said she was disappointed a new strategy to tackle violence against girls did not include plans to reduce the age of domestic abuse victims.",
    "Holly Newton was 15 when she was stabbed to death by her ex-boyfriend in an alleyway in Hexham, Northumberland, in January 2023.",
    "Her family are campaigning for Holly's Law, which would allow people under 16 to be classed as victims of domestic violence from partners. ",
    "The government said its Violence Against Women and Girls strategy aimed to halve such violence within a decade, while the legal framework for domestic abuse would be reviewed to properly represent adolescents' experiences.",
    "Holly's mother Micala Trussler said the family felt their views had not been heard by those in power.",
    "She agreed measures to stamp out misogyny and keep girls safe via education were a step in the right direction but said without Holly's Law, women and girls were being failed.",
    "Micala Trussler wants the law to be changed so under-16s can be classed as victims of domestic abuse",
    "\"For as long as the government isn't acknowledging that under-16s can be a victim of domestic abuse in their own relationships we still aren't safeguarding them,\" she said.",
    "\"How can we help young girls understand abusive relationships if they can't be classed as victims?\"",
    "Logan MacPhail was detained for a minimum of 17 years for Holly's murder.",
    "Holly had complained he had been \"stalking\" her shortly before the attack and she was killed hours before she was due to meet police to discuss her concerns about MacPhail.",
    "Despite MacPhail being convicted of murder, Ms Trussler said the family still felt they lacked answers about how Holly's death was allowed to happen.",
    "\"Because Holly was never seen as a victim of domestic abuse, we were denied a Domestic Homicide Review which meant many of our questions about how it was possible for Logan to kill Holly when there were a number of red flags, remain unanswered,\" she said.",
    "\"I really question whether any lessons have been learned.\"",
    "The government also said police and social services would be given tools to intervene in harmful relationships and be issued with new guidance on teenage relationships.",
    "Do you have a story suggestion for BBC Tyne?"
  ],
  "predictedGuesses": 56
}