{
  "headline": "Zelensky gives stark warning as EU leaders decide on Russia's frozen assets",
  "date": "18 December 2025, 00:43 GMT",
  "content": [
    "Ukraine's president has warned Europe's leaders that an agreement has to be reached by the end of the year",
    "Volodymyr Zelensky has called on EU leaders at a crunch summit urgently to agree  to a multi-billion euro loan in frozen Russian money to fund Ukraine's military and economic needs.",
    "Ukraine is months from running out of cash and Zelensky said without an injection by spring Ukraine \"will have to reduce production of drones\".",
    "Most of Russia's €210bn (£185bn; $245bn) worth of assets in the EU are held by Belgium-based organisation Euroclear. Until now Belgium and some other member states have said they are opposed to using the cash as a \"reparations loan\".",
    "Russia has warned EU leaders not to use its money, but Polish Prime Minister Donald Tusk said they had to \"rise to this occasion\".",
    "The Brussels summit comes at a pivotal moment in the war and Russia has filed a lawsuit against Euroclear in a Moscow court in a bid to get its money back.",
    "Zelensky said Ukraine was definitely facing a 45-50bn [euro] deficit next year, and European Commission chief Ursula von der Leyen vowed \"we will not leave the summit without a solution\". One European government official described being \"cautiously optimistic, not overly optimistic\" that a deal would be agreed. ",
    "All eyes are on Belgian Prime Minister Bart De Wever, who told the Belgian parliament on Thursday that if everything was nailed down and shared by the rest of the EU, \"then we'll jump into the abyss together with the rest of the Europeans and hope the parachute holds us\".",
    "This video can not be played",
    "Watch: BBC correspondent explains European divisions on financial support for Ukraine",
    "Meanwhile, US President Donald Trump has said a deal is closer than ever to end the war - which began with Russia's full-scale invasion of Ukraine in February 2022. ",
    "US and Russian officials are due to meet in Miami this weekend for further talks on a peace plan, a White House official has told AFP news agency. It is thought Kremlin envoy Kirill Dmitriev will talk to Trump envoys Steve Witkoff and Jared Kushner in Miami.",
    "Ukrainian officials are also heading to the US, and President Zelensky, who is in Brussels, said Kyiv needed the money, either to support its army if the war continued, or to direct the funding entirely for recovery: \"It's moral, it's fair and it's legal, confirmed by the expertise of many, many professionals.\"",
    "Russia has not yet responded to the latest peace proposals, but the Kremlin has stressed that plans for a European-led multinational force for Ukraine supported by the US would not be acceptable.",
    "President Vladimir Putin made his feelings towards Europe clear on Wednesday, when he said the continent was in a state of \"total degradation\" and that \"European piglets\" - a derogatory description of Ukraine's European allies - were hoping to profit from Russia's collapse.",
    "Those in favour of loaning Ukraine the money believe it will help deter Putin from continuing the war",
    "The European Commission - the EU's executive arm - has proposed loaning Kyiv about €90bn (£79bn) over the next two years - out of the €210bn of Russian assets sitting in Europe.",
    "That is about two-thirds of the €137bn that Kyiv is thought to need to get through 2026 and 2027.",
    "Until now the EU has handed Ukraine the interest generated by the cash but not the cash itself.",
    "\"This is a crunch time for Ukraine to keep fighting for the next year,\" a Finnish government official told the BBC. \"There are of course peace negotiations but this gives Ukraine leverage to say 'we're not desperate and we have the funds to continue fighting'.\"",
    "The head of the European Commission says it will also ramp up the cost of war for Russia.",
    "Russia's frozen assets are not the only option on the table for EU leaders. Another idea, backed by Belgium, is based on the EU borrowing the money on the international markets, using the EU budget as a guarantee.",
    "However, that would require a unanimous vote and Hungary's Viktor Orban has made it clear he will not allow any more EU money to help Ukraine.",
    "For Ukraine, the hours ahead are significant and EU leaders have been keen to stress the momentous nature of the loan decision.",
    "\"We know the urgency. It is acute. We all feel it. We all see it,\" Ursula von der Leyen told the European Parliament on Wednesday.",
    "Ursula von der Leyen told the European Parliament that two choices were on the table for EU leaders",
    "German Chancellor Friedrich Merz has played a leading role in pushing for the Russian assets to be used, telling the Bundestag on the eve of the summit it was about sending a \"clear signal\" to Moscow that continuing the war was pointless.",
    "EU officials are confident they have a sound legal basis to use the frozen Russian assets, but so far the Belgian prime minister remains unconvinced. ",
    "Hungary is seen as the biggest opponent of the move and, ahead of the summit, Prime Minister Orban and his entourage even suggested that the frozen assets plan had been removed from the summit agenda. A European Commission official stressed that was not the case and it would be a matter for the 27 member states at the summit.",
    "Slovakia's Robert Fico has also opposed using the Russian assets, if it means the money being used to procure weapons rather than for reconstruction needs.",
    "When the pivotal vote does finally take place, it will require a majority of at least 15 member states making up 65% of Europe's population to go through. Whatever happens, European Council President António Costa has promised not to go over the heads of the Belgians.",
    "\"We're not going to vote against Belgium,\" he told Belgian public broadcaster RTBF. \"We'll continue to work very intensively with the Belgian government because we don't want to approve something that might not be acceptable for Belgium.\"",
    "Belgium will also be aware that ratings agency Fitch has placed Euroclear on a negative watch, partly because of \"low\" legal risks to its balance sheet from the European Commission's plans to use the Russian assets. Euroclear's chief executive has also warned against the plan.",
    "\"We have to find a way to respond to Belgium's worries,\" the Finnish official added. \"We are on the same side as Belgium. We will find a solution together to make sure all the risks are checked as much as they can be checked.\"",
    "However, Belgium is not the only country to have doubts, and a majority is not guaranteed.",
    "Italian Prime Minister Giorgia Meloni has told Italian MPs she will endorse the deal \"if the legal basis is solid\".",
    "\"If the legal basis for this initiative were not solid, we would be handing Russia its first real victory since the beginning of this conflict.\"",
    "Malta, Bulgaria and the Czech Republic are also said to be unconvinced by the controversial proposals.",
    "If the deal is passed and the Russian assets are given to Ukraine, the worst-case scenario for Belgium would be one in which a court would order it to hand the money back to Russia. ",
    "Some countries have said they would be prepared to provide billions of euros in financial guarantees, but Belgium will want to see the numbers add up.",
    "At any rate, Commission officials are confident that the only way for Russia to get it back would be by paying reparations to Ukraine - at which point Ukraine would hand its \"reparations loan\" back to the EU."
  ],
  "predictedGuesses": 75
}