{
  "headline": "Doctors' strike disruption warning in  South East",
  "date": "17 December 2025",
  "content": [
    "The strike is due to last five days",
    "Patients in south-east England are being told to expect disruption as doctors start a five-day strike.",
    "NHS bosses across Kent, Sussex and Surrey say they are struggling to keep as many services going as they have done in recent walkouts.",
    "The British Medical Association (BMA) wants a long-term plan to increase the pay of resident doctors, the new name for junior doctors, plus a guarantee of new training places for qualified doctors.",
    "Health Secretary Wes Streeting said the strike had been timed to inflict most damage on the NHS and put patients at risk.",
    "But the BMA said it would work with NHS bosses to ensure safety.",
    "Milo Simpson, a resident doctor in acute medicine at the Royal Sussex County Hospital in Brighton joined the picket line.",
    "He said: \"I do not want to be out on strike today - I'd much rather be at work.",
    "\"However we cannot have this this jobs crisis we're facing at the moment and this recruitment and retention crisis due to pay erosion.\" ",
    "This is the 14th walkout by resident doctors in a long-running pay dispute.",
    "Dr Gareth Roberts, a respiratory consultant at Frimley Health NHS Hospitals Trust in Surrey, says the impact of the strikes will be felt across the NHS.",
    "He said: \"All members of our staff across the whole of the organisation do become involved in the industrial action and there's colleagues of mine who are making those difficult phone calls to patients to tell them their appointment or procedure have either been cancelled or re-arranged.",
    "\"That obviously that puts a lot of pressure on those people as well.\"",
    "Kate Langford, chief medical officer of NHS Kent & Medway, has offered advice to patients during the strike.",
    "She says: \"If you've got something serious going on ring 999 and come to an emergency department just the same as you would usually, as that care will be there for you.",
    "\"If it is less urgent don't come to hospital without calling NHS 111 first.\"",
    "Milo Simpson, a resident doctor, joined the picket line in Brighton  ",
    "Speaking in Parliament on Wednesday morning, the health secretary said there was no sign of a breakthrough after five hours of talks with BMA representatives.",
    "\"I think on jobs, [we are] broadly in agreement, [but] on pay [we are] too far apart,\" Streeting said.",
    "\"These strikes will come at a cost of £250m and impact on operational pressures, on patients and on the whole NHS workforce, and I deeply regret we are in this situation.\""
  ],
  "predictedGuesses": 56
}